/*
* Написать функцию которая принимает некий коэффицент
* и генерирует новую функцию, которая принимает некое число
* и возвращает его умноженным на этот коэфицент
* точность до 1/10000
* */
function z1() {

}

/*
* Написать функцию которая принимает некий object
* и генерирует новую функцию, которая принимает callback
* и вызывает его с контекстом object
* */
function z2() {

}

/*
* Написать функцию повторяющую функционал Array.push()
* первым аргументом передаётся массив, над которым совершается действие
* */
function z3() {

}

/*
* повторить функционал функции Array.find
* первым аргументом передается массив
* */
function z4() {

}

module.exports = { z1, z2, z3, z4 };
